/* ************************************************************************
 *       Filename:  15-字符数组.c
 *    Description:  
 *        Version:  1.0
 *        Created:  2018年10月05日 19时49分03秒
 *       Revision:  none
 *       Compiler:  gcc
 *         Author:  YOUR NAME (), 
 *        Company:  
 * ************************************************************************/

#include <stdio.h>


int main(int argc, char *argv[])
{
	// C语言没有字符串类型，用字符数组模拟
	char a[10];
	
	// 字符串一定是字符数组,字符数组不一定是字符串
	// 如果字符数组以字符'\0'('\0'等价于数字0)结尾，那么这个字符数组就是字符串
	
	// 字符数组
	char b[] = {'a', 'b', 'c'};

	char c[] = {'a', 'b', 'c', '\0'}; // 字符串
	char d[] = {'a', 'b', 'c', 0}; // 字符串

	return 0;
}


